#Напишіть функцію format_string, яка центрує рядок у рамках заданої довжини length.
#Задачі:
"""
Створіть функцію format_string, яка приймає два аргументи: string рядок, який потрібно форматувати та length довжина, 
у межах якої потрібно центрувати рядок.
Якщо довжина string більша або дорівнює length, поверніть рядок без змін.
Якщо довжина string менша за length, додайте перед рядком пробіли, для того, щоб рядок був центрований
 у рамках length. Кількість пробілів визначте за формулою (length - len(string)) // 2.
Поверніть з функції відформатований рядок, що центрується у межах length.
Очікуваний результат:

Функція format_string повертає відформатований рядок відповідно до заданих правил.

Підказки:

Використовуйте len() для визначення довжини рядка.
Для створення рядка з пробілів використовуйте " " * кількість_пробілів.
"""

def format_string(string, length):
    # Визначаємо кількість пробілів для центрованого вирівнювання
    space = (length - len(string)) // 2

    if len(string) >= length:
        return string
    else:
        # Додаємо пробіли перед рядком для центрованого вирівнювання
        return ' ' * space + string
print(format_string("hgjhggjh", 20))    
